In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('India_census.csv')
df.head()

,District_code,State_name,District_name,Population,Male,Female,Literate,Workers,Male_Workers,Female_Workers,...,Christians,Sikhs,Buddhists,Jains,Secondary_Education,Higher_Education,Graduate_Education,Age_Group_0_29,Age_Group_30_49,Age_Group_50
0,1,JAMMU AND KASHMIR,Kupwara,870354,474190,396164,439654,229064,190899,38165,...,1700,5600,66,39,74948,39709,21751,600759,178435,89679
1,2,JAMMU AND KASHMIR,Badgam,753745,398041,355704,335649,214866,162578,52288,...,1489,5559,47,6,66459,41367,27950,503223,160933,88978
2,3,JAMMU AND KASHMIR,Leh(Ladakh),133487,78971,54516,93770,75079,53265,21814,...,658,1092,88635,103,16265,8923,6197,70703,41515,21019
3,4,JAMMU AND KASHMIR,Kargil,140802,77785,63017,86236,51873,39839,12034,...,604,1171,20126,28,16938,9826,3077,87532,35561,17488
4,5,JAMMU AND KASHMIR,Punch,476835,251899,224936,261724,161393,117677,43716,...,958,11188,83,10,46062,29517,13962,304979,109818,61334

In [21]:
df.shape

(640, 25)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 640 entries, 0 to 639
Data columns (total 25 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   District_code         640 non-null    int64
 1   State_name            640 non-null    object
 2   District_name         640 non-null    object
 3   Population            640 non-null    int64
 4   Male                  640 non-null    int64
 5   Female                640 non-null    int64
 6   Literate              640 non-null    int64
 7   Workers               640 non-null    int64
 8   Male_Workers          640 non-null    int64
 9   Female_Workers        640 non-null    int64
 10  Cultivator_Workers    640 non-null    int64
 11  Agricultural_Workers  640 non-null    int64
 12  Household_Workers     640 non-null    int64
 13  Hindus                640 non-null    int64
 14  Muslims               640 non-null    int64
 15  Christians            640 non-null    int64
 16  Sikhs                 640 non-null    int64
 17  Buddhists             640 non-null    int64
 18  Jains                 640 non-null    int64
 19  Secondary_Education   640 non-null    int64
 20  Higher_Education      640 non-null    int64
 21  Graduate_Education    640 non-null    int64
 22  Age_Group_0_29        640 non-null    int64
 23  Age_Group_30_49       640 non-null    int64
 24  Age_Group_50          640 non-null    int64
dtypes: int64(23), object(2)
memory usage: 125.1+ KB

In [11]:
df.shape

(640, 25)

### Find total no.of State names in record

In [40]:
df['State_name'].unique()

array(['JAMMU AND KASHMIR', 'HIMACHAL PRADESH', 'PUNJAB', 'CHANDIGARH',
       'UTTARAKHAND', 'HARYANA', 'NCT OF DELHI', 'RAJASTHAN',
       'UTTAR PRADESH', 'BIHAR', 'SIKKIM', 'ARUNACHAL PRADESH',
       'NAGALAND', 'MANIPUR', 'MIZORAM', 'TRIPURA', 'MEGHALAYA', 'ASSAM',
       'WEST BENGAL', 'JHARKHAND', 'ORISSA', 'CHHATTISGARH',
       'MADHYA PRADESH', 'GUJARAT', 'DAMAN AND DIU',
       'DADRA AND NAGAR HAVELI', 'MAHARASHTRA', 'ANDHRA PRADESH',
       'KARNATAKA', 'GOA', 'LAKSHADWEEP', 'KERALA', 'TAMIL NADU',
       'PONDICHERRY', 'ANDAMAN AND NICOBAR ISLANDS'], dtype=object)

In [42]:
state = df['State_name'].unique()
print("Total no.of states in India:", len(state))

Total no.of states in India: 35

### Find the tamil nadu all datas

In [29]:
tamil = df[df['State_name'] == 'TAMIL NADU']
tamil.head()

,District_code,State_name,District_name,Population,Male,Female,Literate,Workers,Male_Workers,Female_Workers,...,Christians,Sikhs,Buddhists,Jains,Secondary_Education,Higher_Education,Graduate_Education,Age_Group_0_29,Age_Group_30_49,Age_Group_50
601,602,TAMIL NADU,Thiruvallur,3728104,1876062,1852042,2791721,1538054,1103563,434491,...,233633,1422,951,3693,622789,303091,451321,1925296,1154775,643614
602,603,TAMIL NADU,Chennai,4646732,2335844,2310888,3776276,1817297,1369302,447995,...,358662,2851,2804,51708,801050,464207,905515,2271657,1468902,899279
603,604,TAMIL NADU,Kancheepuram,3998252,2012958,1985294,3013382,1673814,1181308,492506,...,256762,1620,990,4962,634172,312208,526886,2076492,1200284,715895
604,605,TAMIL NADU,Vellore,3936331,1961688,1974643,2773928,1689330,1123874,565456,...,111390,676,438,3514,641585,311434,308514,2096113,1116437,720713
605,606,TAMIL NADU,Tiruvannamalai,2464875,1235889,1228986,1626813,1238177,738995,499182,...,66987,232,157,7898,343955,174560,158041,1301347,683904,477668

###  Find the null values

In [20]:
# NO.of  NO-NULL values:
tamil.count()

District_code           32
State_name              32
District_name           32
Population              32
Male                    32
Female                  32
Literate                32
Workers                 32
Male_Workers            32
Female_Workers          32
Cultivator_Workers      32
Agricultural_Workers    32
Household_Workers       32
Hindus                  32
Muslims                 32
Christians              32
Sikhs                   32
Buddhists               32
Jains                   32
Secondary_Education     32
Higher_Education        32
Graduate_Education      32
Age_Group_0_29          32
Age_Group_30_49         32
Age_Group_50            32
dtype: int64

In [19]:
#No NULL values 
tamil.isnull().sum()

District_code           0
State_name              0
District_name           0
Population              0
Male                    0
Female                  0
Literate                0
Workers                 0
Male_Workers            0
Female_Workers          0
Cultivator_Workers      0
Agricultural_Workers    0
Household_Workers       0
Hindus                  0
Muslims                 0
Christians              0
Sikhs                   0
Buddhists               0
Jains                   0
Secondary_Education     0
Higher_Education        0
Graduate_Education      0
Age_Group_0_29          0
Age_Group_30_49         0
Age_Group_50            0
dtype: int64

### Find Cultivator workers in  each district and  which district have maximum values

In [38]:
tamil.groupby('District_name').Cultivator_Workers.sum().sort_values(ascending=False)

District_name
Viluppuram         369646
Tiruvannamalai     292641
Salem              257004
Krishnagiri        236038
Pudukkottai        209270
Dharmapuri         201328
Erode              178170
Vellore            175108
Ramanathapuram     173767
Tiruchirappalli    170669
Dindigul           165405
Cuddalore          165170
Namakkal           158473
Sivaganga          141003
Tiruppur           135817
Thanjavur          129913
Perambalur         117304
Tirunelveli        115715
Ariyalur           107312
Madurai             92719
Kancheepuram        89343
Karur               85872
Coimbatore          80217
Thiruvallur         73444
Thiruvarur          69883
Nagapattinam        67482
Virudhunagar        57153
Thoothukkudi        48515
Theni               38367
The Nilgiris        15645
Kanniyakumari       15610
Chennai             14454
Name: Cultivator_Workers, dtype: int64

### Find the  Hindus  and Whcih State have more hindus

In [118]:
#Top 10 Hindus states
df.groupby('State_name').Hindus.sum().sort_values(ascending=False).head(10)

State_name
UTTAR PRADESH     159312654
MAHARASHTRA        89703057
BIHAR              86078686
ANDHRA PRADESH     74824149
MADHYA PRADESH     66007121
WEST BENGAL        64385546
TAMIL NADU         63188168
RAJASTHAN          60657103
GUJARAT            53533988
KARNATAKA          51317472
Name: Hindus, dtype: int64

### whaich religion is more have  in LAKSHADWEEP

In [60]:
ld = df[df['State_name'] =='LAKSHADWEEP']

In [68]:
ld.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
District_code,1.0,587.0,NaN,587.0,587.0,587.0,587.0,587.0
Population,1.0,64473.0,NaN,64473.0,64473.0,64473.0,64473.0,64473.0
Male,1.0,33123.0,NaN,33123.0,33123.0,33123.0,33123.0,33123.0
Female,1.0,31350.0,NaN,31350.0,31350.0,31350.0,31350.0,31350.0
Literate,1.0,52553.0,NaN,52553.0,52553.0,52553.0,52553.0,52553.0
Workers,1.0,18753.0,NaN,18753.0,18753.0,18753.0,18753.0,18753.0
Male_Workers,1.0,15318.0,NaN,15318.0,15318.0,15318.0,15318.0,15318.0
Female_Workers,1.0,3435.0,NaN,3435.0,3435.0,3435.0,3435.0,3435.0
Cultivator_Workers,1.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0
Agricultural_Workers,1.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0
Household_Workers,1.0,264.0,NaN,264.0,264.0,264.0,264.0,264.0
Hindus,1.0,1788.0,NaN,1788.0,1788.0,1788.0,1788.0,1788.0
Muslims,1.0,62268.0,NaN,62268.0,62268.0,62268.0,62268.0,62268.0
Christians,1.0,317.0,NaN,317.0,317.0,317.0,317.0,317.0
Sikhs,1.0,8.0,NaN,8.0,8.0,8.0,8.0,8.0
Buddhists,1.0,10.0,NaN,10.0,10.0,10.0,10.0,10.0
Jains,1.0,11.0,NaN,11.0,11.0,11.0,11.0,11.0
Secondary_Education,1.0,13997.0,NaN,13997.0,13997.0,13997.0,13997.0,13997.0
Higher_Education,1.0,6642.0,NaN,6642.0,6642.0,6642.0,6642.0,6642.0
Graduate_Education,1.0,3491.0,NaN,3491.0,3491.0,3491.0,3491.0,3491.0
Age_Group_0_29,1.0,33877.0,NaN,33877.0,33877.0,33877.0,33877.0,33877.0
Age_Group_30_49,1.0,19244.0,NaN,19244.0,19244.0,19244.0,19244.0,19244.0
Age_Group_50,1.0,11237.0,NaN,11237.0,11237.0,11237.0,11237.0,11237.0

### More Muslims are live in lakshdweep

### Which district has more males

In [84]:
#Top 10 values
df.groupby('District_name').Male.sum().sort_values(ascending=False).head(10)

District_name
Thane                         5865078
North Twenty Four Parganas    5119389
Mumbai Suburban               5031323
Bangalore                     5022661
Pune                          4924105
South Twenty Four Parganas    4173778
Barddhaman                    3966889
Ahmadabad                     3788051
Murshidabad                   3627564
Jaipur                        3468507
Name: Male, dtype: int64

### Which district has more pupolation

In [92]:
df.groupby('District_name').Population.sum().sort_values(ascending=False)

District_name
Thane                         11060148
North Twenty Four Parganas    10009781
Bangalore                      9621551
Pune                           9429408
Mumbai Suburban                9356962
                                ...
Nicobars                         36842
Upper Siang                      35320
Lahul AND Spiti                  31564
Anjaw                            21167
Dibang Valley                     8004
Name: Population, Length: 634, dtype: int64

In [89]:
# where is the Thane district located  in Maharashtra
df[df['District_name'] =='Thane']

,District_code,State_name,District_name,Population,Male,Female,Literate,Workers,Male_Workers,Female_Workers,...,Christians,Sikhs,Buddhists,Jains,Secondary_Education,Higher_Education,Graduate_Education,Age_Group_0_29,Age_Group_30_49,Age_Group_50
516,517,MAHARASHTRA,Thane,11060148,5865078,5195070,8227161,4492767,3363123,1129644,...,280700,39149,449617,172052,1751284,1080597,961719,6184519,3241888,1579921

### which state has more population

In [94]:
#Top 20 states population
df.groupby('State_name').Population.sum().sort_values(ascending=False).head(20)

State_name
UTTAR PRADESH        199812341
MAHARASHTRA          112374333
BIHAR                104099452
WEST BENGAL           91276115
ANDHRA PRADESH        84580777
MADHYA PRADESH        72626809
TAMIL NADU            72147030
RAJASTHAN             68548437
KARNATAKA             61095297
GUJARAT               60439692
ORISSA                41974218
KERALA                33406061
JHARKHAND             32988134
ASSAM                 31205576
PUNJAB                27743338
CHHATTISGARH          25545198
HARYANA               25351462
NCT OF DELHI          16787941
JAMMU AND KASHMIR     12541302
UTTARAKHAND           10086292
Name: Population, dtype: int64

### Which District has more  Household Workers in Tamilnadu

In [96]:
tamil.groupby('District_name').Household_Workers.sum().sort_values(ascending=False)

District_name
Tirunelveli        239664
Salem              141503
Vellore            136415
Thiruvallur         58240
Kancheepuram        54732
Erode               54322
Coimbatore          50085
Madurai             47293
Tiruvannamalai      46720
Tiruppur            40988
Namakkal            38797
Viluppuram          38237
Chennai             37345
Kanniyakumari       35789
Virudhunagar        35298
Cuddalore           32027
Thanjavur           31200
Dindigul            30829
Tiruchirappalli     30386
Ramanathapuram      25228
Thoothukkudi        22863
Krishnagiri         21918
Dharmapuri          15341
Theni               14939
Sivaganga           14656
Pudukkottai         13941
Ariyalur            13564
Nagapattinam        11555
Karur               11340
Thiruvarur          10440
Perambalur           5343
The Nilgiris         3895
Name: Household_Workers, dtype: int64

### Which District has more Agricultural Workers in Tamilnadu

In [98]:
tamil.groupby('District_name').Agricultural_Workers.sum().sort_values(ascending=False)

District_name
Viluppuram         832213
Cuddalore          539412
Tiruvannamalai     525063
Dindigul           467959
Salem              454210
Thanjavur          415361
Vellore            391955
Tirunelveli        379763
Tiruchirappalli    378782
Madurai            372828
Erode              370212
Nagapattinam       345057
Theni              315161
Pudukkottai        305149
Thiruvarur         295188
Kancheepuram       272514
Thiruvallur        270586
Dharmapuri         267345
Krishnagiri        263328
Namakkal           253726
Tiruppur           246333
Coimbatore         230026
Virudhunagar       208702
Karur              200837
Thoothukkudi       200644
Sivaganga          199563
Ariyalur           166837
Ramanathapuram     153874
Perambalur         118278
The Nilgiris        79100
Kanniyakumari       72867
Chennai             13674
Name: Agricultural_Workers, dtype: int64

### which states has more Literate

In [104]:
df.groupby('State_name').Literate.sum().sort_values(ascending=False)

State_name
UTTAR PRADESH                  114397555
MAHARASHTRA                     81554290
WEST BENGAL                     61538281
BIHAR                           52504553
TAMIL NADU                      51837507
ANDHRA PRADESH                  50556760
MADHYA PRADESH                  42851169
GUJARAT                         41093358
KARNATAKA                       40647322
RAJASTHAN                       38275282
KERALA                          28135824
ORISSA                          26742595
ASSAM                           19177977
PUNJAB                          18707137
JHARKHAND                       18328069
HARYANA                         16598988
CHHATTISGARH                    15379922
NCT OF DELHI                    12737767
JAMMU AND KASHMIR                7067233
UTTARAKHAND                      6880953
HIMACHAL PRADESH                 5039736
TRIPURA                          2804783
MANIPUR                          1908476
MEGHALAYA                        1785005
NAGALAND                         1342434
GOA                              1165487
PONDICHERRY                       957309
MIZORAM                           848175
CHANDIGARH                        805438
ARUNACHAL PRADESH                 766005
SIKKIM                            444952
ANDAMAN AND NICOBAR ISLANDS       294281
DADRA AND NAGAR HAVELI            223230
DAMAN AND DIU                     188406
LAKSHADWEEP                        52553
Name: Literate, dtype: int64

### Which district has more literates in tamilnadu

In [106]:
tamil.groupby('District_name').Literate.sum().sort_values(ascending=False)

District_name
Chennai            3776276
Kancheepuram       3013382
Thiruvallur        2791721
Vellore            2773928
Coimbatore         2635907
Salem              2285562
Tirunelveli        2273457
Madurai            2273430
Viluppuram         2195776
Tiruchirappalli    2038981
Cuddalore          1815281
Thanjavur          1790998
Tiruppur           1760566
Tiruvannamalai     1626813
Kanniyakumari      1548738
Erode              1492662
Dindigul           1481834
Virudhunagar       1398788
Thoothukkudi       1349697
Nagapattinam       1213008
Krishnagiri        1187958
Namakkal           1176131
Pudukkottai        1110545
Ramanathapuram      978946
Sivaganga           959744
Thiruvarur          946471
Dharmapuri          917709
Theni               870080
Karur               727044
The Nilgiris        569647
Ariyalur            480604
Perambalur          375823
Name: Literate, dtype: int64